zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE316/startup_MCXE316.cpp
//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif // __REDLIB__
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif // __REDLIB
#else
#error Unsupported toolchain!
#endif

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#elif defined(__ICCARM__)
#pragma segment="CSTACK"
#define __StackTop __section_end("CSTACK")
#define __StackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];

extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];

extern uint32_t __ram_function_flash_start[];
extern uint32_t __ram_function_start__[];
extern uint32_t __ram_function_end__[];

extern uint32_t __noncache_data_flash_start[];
extern uint32_t __noncache_data_start__[];
extern uint32_t __noncache_data_end__[];

extern uint32_t __noncache_bss_start__[];
extern uint32_t __noncache_bss_end__[];

extern uint32_t __qadata_flash_start[];
extern uint32_t __qadata_start__[];
extern uint32_t __qadata_end__[];

extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];
#else
#error Unsupported toolchain!
#endif

//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif

//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (* const __Vectors[])(void);
__attribute__ ((used, section(".isr_vector")))
void (* const __Vectors[])(void) = {
    (void(*)())(uint32_t)Image$$ARM_LIB_STACK$$ZI$$Limit,   // The initial stack pointer
    Reset_Handler,                     // The reset handler
#elif defined(__MCUXPRESSO)
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
#elif defined (__ICCARM__)
extern void (* const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__ ((used, section(".intvec")))
void (* const __vector_table[])(void) = {
    (void(*)())(uint32_t)__StackTop,   // The initial stack pointer
    Reset_Handler,                     // The reset handler
#elif defined (__GNUC__)
extern void (* const __isr_vector[])(void);
__attribute__ ((used, section(".isr_vector")))
void (* const __isr_vector[])(void) = {
    (void(*)())(uint32_t)__StackTop,   // The initial stack pointer
    Reset_Handler,                     // The reset handler
#else
#error Unsupported toolchain!
#endif
    NMI_Handler,                       // NMI Handler
    HardFault_Handler,                 // Hard Fault Handler
    MemManage_Handler,                 // MPU Fault Handler
    BusFault_Handler,                  // Bus Fault Handler
    UsageFault_Handler,                // Usage Fault Handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall Handler
    DebugMon_Handler,                  // Debug Monitor Handler
    0,                                 // Reserved
    PendSV_Handler,                    // PendSV Handler
    SysTick_Handler,                   // SysTick Handler

    // Chip Level
    Reserved16_IRQHandler,         // 16 : Reserved interrupt
    Reserved17_IRQHandler,         // 17 : Reserved interrupt
    Reserved18_IRQHandler,         // 18 : Reserved interrupt
    Reserved19_IRQHandler,         // 19 : Reserved interrupt
    DMATCD0_IRQHandler,            // 20 : DMA transfer complete and error CH0
    DMATCD1_IRQHandler,            // 21 : DMA transfer complete and error CH1
    DMATCD2_IRQHandler,            // 22 : DMA transfer complete and error CH2
    DMATCD3_IRQHandler,            // 23 : DMA transfer complete and error CH3
    DMATCD4_IRQHandler,            // 24 : DMA transfer complete and error CH4
    DMATCD5_IRQHandler,            // 25 : DMA transfer complete and error CH5
    DMATCD6_IRQHandler,            // 26 : DMA transfer complete and error CH6
    DMATCD7_IRQHandler,            // 27 : DMA transfer complete and error CH7
    DMATCD8_IRQHandler,            // 28 : DMA transfer complete and error CH8
    DMATCD9_IRQHandler,            // 29 : DMA transfer complete and error CH9
    DMATCD10_IRQHandler,           // 30 : DMA transfer complete and error CH10
    DMATCD11_IRQHandler,           // 31 : DMA transfer complete and error CH11
    Reserved32_IRQHandler,         // 32 : Reserved interrupt
    Reserved33_IRQHandler,         // 33 : Reserved interrupt
    Reserved34_IRQHandler,         // 34 : Reserved interrupt
    Reserved35_IRQHandler,         // 35 : Reserved interrupt
    Reserved36_IRQHandler,         // 36 : Reserved interrupt
    Reserved37_IRQHandler,         // 37 : Reserved interrupt
    Reserved38_IRQHandler,         // 38 : Reserved interrupt
    Reserved39_IRQHandler,         // 39 : Reserved interrupt
    Reserved40_IRQHandler,         // 40 : Reserved interrupt
    Reserved41_IRQHandler,         // 41 : Reserved interrupt
    Reserved42_IRQHandler,         // 42 : Reserved interrupt
    Reserved43_IRQHandler,         // 43 : Reserved interrupt
    Reserved44_IRQHandler,         // 44 : Reserved interrupt
    Reserved45_IRQHandler,         // 45 : Reserved interrupt
    Reserved46_IRQHandler,         // 46 : Reserved interrupt
    Reserved47_IRQHandler,         // 47 : Reserved interrupt
    Reserved48_IRQHandler,         // 48 : Reserved interrupt
    Reserved49_IRQHandler,         // 49 : Reserved interrupt
    Reserved50_IRQHandler,         // 50 : Reserved interrupt
    Reserved51_IRQHandler,         // 51 : Reserved interrupt
    ERM_0_IRQHandler,              // 52 : Single bit ECC error
    ERM_1_IRQHandler,              // 53 : Multi bit ECC error
    MCM_IRQHandler,                // 54 : FPU ORed sources ORed with MCM Write Abort interrupt
    STM0_IRQHandler,               // 55 : Single interrupt vector for all four channels
    Reserved56_IRQHandler,         // 56 : Reserved interrupt
    Reserved57_IRQHandler,         // 57 : Reserved interrupt
    SWT0_IRQHandler,               // 58 : Platform watchdog initial time-out
    Reserved59_IRQHandler,         // 59 : Reserved interrupt
    Reserved60_IRQHandler,         // 60 : Reserved interrupt
    CTI_INT0_IRQHandler,           // 61 : CTI interrupt0
    CTI_INT1_IRQHandler,           // 62 : CTI interrupt1
    Reserved63_IRQHandler,         // 63 : Reserved interrupt
    FLASH_0_IRQHandler,            // 64 : Program or erase operation is completed
    FLASH_1_IRQHandler,            // 65 : Main watchdog timeout interrupt
    FLASH_2_IRQHandler,            // 66 : Alternate watchdog timeout interrupt
    RGM_IRQHandler,                // 67 : Interrupt request to the system
    PMC_IRQHandler,                // 68 : One interrupt for all LVDs, One interrupt for all HVDs
    SIUL2_0_IRQHandler,            // 69 : External Interrupt Vector 0
    SIUL2_1_IRQHandler,            // 70 : External Interrupt Vector 1
    SIUL2_2_IRQHandler,            // 71 : External Interrupt Vector 2
    SIUL2_3_IRQHandler,            // 72 : External Interrupt Vector 3
    Reserved73_IRQHandler,         // 73 : Reserved interrupt
    Reserved74_IRQHandler,         // 74 : Reserved interrupt
    Reserved75_IRQHandler,         // 75 : Reserved interrupt
    Reserved76_IRQHandler,         // 76 : Reserved interrupt
    EMIOS0_2_IRQHandler,           // 77 : Interrupt request 23,22,21,20
    EMIOS0_3_IRQHandler,           // 78 : Interrupt request 19,18,17,16
    EMIOS0_4_IRQHandler,           // 79 : Interrupt request 15,14,13,12
    EMIOS0_5_IRQHandler,           // 80 : Interrupt request 11,10,9,8
    EMIOS0_6_IRQHandler,           // 81 : Interrupt request 7,6,5,4
    EMIOS0_7_IRQHandler,           // 82 : Interrupt request 3,2,1,0
    Reserved83_IRQHandler,         // 83 : Reserved interrupt
    Reserved84_IRQHandler,         // 84 : Reserved interrupt
    EMIOS1_2_IRQHandler,           // 85 : Interrupt request 23,22,21,20
    EMIOS1_3_IRQHandler,           // 86 : Interrupt request 19,18,17,16
    EMIOS1_4_IRQHandler,           // 87 : Interrupt request 15,14,13,12
    EMIOS1_5_IRQHandler,           // 88 : Interrupt request 11,10,9,8
    EMIOS1_6_IRQHandler,           // 89 : Interrupt request 7,6,5,4
    EMIOS1_7_IRQHandler,           // 90 : Interrupt request 3,2,1,0
    Reserved91_IRQHandler,         // 91 : Reserved interrupt
    Reserved92_IRQHandler,         // 92 : Reserved interrupt
    Reserved93_IRQHandler,         // 93 : Reserved interrupt
    Reserved94_IRQHandler,         // 94 : Reserved interrupt
    Reserved95_IRQHandler,         // 95 : Reserved interrupt
    Reserved96_IRQHandler,         // 96 : Reserved interrupt
    Reserved97_IRQHandler,         // 97 : Reserved interrupt
    Reserved98_IRQHandler,         // 98 : Reserved interrupt
    WKPU_IRQHandler,               // 99 : Interrupts from pad group 0, 1, 2, 3, 0_64, 1_64, 2_64, 3_64
    CMU0_IRQHandler,               // 100: CMU0 interrupt
    CMU1_IRQHandler,               // 101: CMU1 interrupt
    CMU2_IRQHandler,               // 102: CMU2 interrupt
    BCTU_IRQHandler,               // 103: Ored interrupt for BCTU
    Reserved104_IRQHandler,        // 104: Reserved interrupt
    Reserved105_IRQHandler,        // 105: Reserved interrupt
    Reserved106_IRQHandler,        // 106: Reserved interrupt
    Reserved107_IRQHandler,        // 107: Reserved interrupt
    LCU0_IRQHandler,               // 108: Interrupt_0, 1, 2
    LCU1_IRQHandler,               // 109: Interrupt_0, 1, 2
    Reserved110_IRQHandler,        // 110: Reserved interrupt
    Reserved111_IRQHandler,        // 111: Reserved interrupt
    PIT0_IRQHandler,               // 112: Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3,Interrupt for Channel4
    PIT1_IRQHandler,               // 113: Interrupt for Channel0,Interrupt for Channel1,Interrupt for Channel2,Interrupt for Channel3
    Reserved114_IRQHandler,        // 114: Reserved interrupt
    Reserved115_IRQHandler,        // 115: Reserved interrupt
    Reserved116_IRQHandler,        // 116: Reserved interrupt
    Reserved117_IRQHandler,        // 117: Reserved interrupt
    RTC_IRQHandler,                // 118: RTCF or ROVRF interrupt to be serviced by the system controller
    Reserved119_IRQHandler,        // 119: Reserved interrupt
    Reserved120_IRQHandler,        // 120: Reserved interrupt
    Reserved121_IRQHandler,        // 121: Reserved interrupt
    Reserved122_IRQHandler,        // 122: Reserved interrupt
    Reserved123_IRQHandler,        // 123: Reserved interrupt
    Reserved124_IRQHandler,        // 124: Reserved interrupt
    FlexCAN0_0_IRQHandler,         // 125: Ored status and error
    FlexCAN0_1_IRQHandler,         // 126: Message Buffer Interrupt line 0-31
    FlexCAN0_2_IRQHandler,         // 127: Message Buffer Interrupt line 32-63
    FlexCAN0_3_IRQHandler,         // 128: Message Buffer Interrupt line 64-95
    FlexCAN1_0_IRQHandler,         // 129: Ored status and error
    FlexCAN1_1_IRQHandler,         // 130: Message Buffer Interrupt line 0-31
    FlexCAN1_2_IRQHandler,         // 131: Message Buffer Interrupt line 32-63
    FlexCAN2_0_IRQHandler,         // 132: Ored status and error
    FlexCAN2_1_IRQHandler,         // 133: Message Buffer Interrupt line 0-31
    FlexCAN2_2_IRQHandler,         // 134: Message Buffer Interrupt line 32-63
    Reserved135_IRQHandler,        // 135: Reserved interrupt
    Reserved136_IRQHandler,        // 136: Reserved interrupt
    Reserved137_IRQHandler,        // 137: Reserved interrupt
    Reserved138_IRQHandler,        // 138: Reserved interrupt
    Reserved139_IRQHandler,        // 139: Reserved interrupt
    Reserved140_IRQHandler,        // 140: Reserved interrupt
    Reserved141_IRQHandler,        // 141: Reserved interrupt
    Reserved142_IRQHandler,        // 142: Reserved interrupt
    Reserved143_IRQHandler,        // 143: Reserved interrupt
    Reserved144_IRQHandler,        // 144: Reserved interrupt
    Reserved145_IRQHandler,        // 145: Reserved interrupt
    Reserved146_IRQHandler,        // 146: Reserved interrupt
    Reserved147_IRQHandler,        // 147: Reserved interrupt
    Reserved148_IRQHandler,        // 148: Reserved interrupt
    Reserved149_IRQHandler,        // 149: Reserved interrupt
    Reserved150_IRQHandler,        // 150: Reserved interrupt
    Reserved151_IRQHandler,        // 151: Reserved interrupt
    Reserved152_IRQHandler,        // 152: Reserved interrupt
    Reserved153_IRQHandler,        // 153: Reserved interrupt
    Reserved154_IRQHandler,        // 154: Reserved interrupt
    FLEXIO_IRQHandler,             // 155: FlexIO Interrupt
    Reserved156_IRQHandler,        // 156: Reserved interrupt
    LPUART_0_IRQHandler,           // 157: TX and RX interrupt
    LPUART_1_IRQHandler,           // 158: TX and RX interrupt
    LPUART_2_IRQHandler,           // 159: TX and RX interrupt
    LPUART_3_IRQHandler,           // 160: TX and RX interrupt
    Reserved161_IRQHandler,        // 161: Reserved interrupt
    Reserved162_IRQHandler,        // 162: Reserved interrupt
    Reserved163_IRQHandler,        // 163: Reserved interrupt
    Reserved164_IRQHandler,        // 164: Reserved interrupt
    Reserved165_IRQHandler,        // 165: Reserved interrupt
    Reserved166_IRQHandler,        // 166: Reserved interrupt
    Reserved167_IRQHandler,        // 167: Reserved interrupt
    Reserved168_IRQHandler,        // 168: Reserved interrupt
    Reserved169_IRQHandler,        // 169: Reserved interrupt
    Reserved170_IRQHandler,        // 170: Reserved interrupt
    Reserved171_IRQHandler,        // 171: Reserved interrupt
    Reserved172_IRQHandler,        // 172: Reserved interrupt
    Reserved173_IRQHandler,        // 173: Reserved interrupt
    Reserved174_IRQHandler,        // 174: Reserved interrupt
    Reserved175_IRQHandler,        // 175: Reserved interrupt
    Reserved176_IRQHandler,        // 176: Reserved interrupt
    LPI2C0_IRQHandler,             // 177: LPI2C Master Interrupt
    LPI2C1_IRQHandler,             // 178: LPI2C Master Interrupt
    Reserved179_IRQHandler,        // 179: Reserved interrupt
    Reserved180_IRQHandler,        // 180: Reserved interrupt
    LPSPI0_IRQHandler,             // 181: LPSPI Interrupt
    LPSPI1_IRQHandler,             // 182: LPSPI Interrupt
    LPSPI2_IRQHandler,             // 183: LPSPI Interrupt
    LPSPI3_IRQHandler,             // 184: LPSPI Interrupt
    Reserved185_IRQHandler,        // 185: Reserved interrupt
    Reserved186_IRQHandler,        // 186: Reserved interrupt
    Reserved187_IRQHandler,        // 187: Reserved interrupt
    Reserved188_IRQHandler,        // 188: Reserved interrupt
    Reserved189_IRQHandler,        // 189: Reserved interrupt
    Reserved190_IRQHandler,        // 190: Reserved interrupt
    Reserved191_IRQHandler,        // 191: Reserved interrupt
    Reserved192_IRQHandler,        // 192: Reserved interrupt
    Reserved193_IRQHandler,        // 193: Reserved interrupt
    JDC_IRQHandler,                // 194: Indicates new data to be read from JIN_IPS register or can be written to JOUT_IPS register
    Reserved195_IRQHandler,        // 195: Reserved interrupt
    ADC0_IRQHandler,               // 196: End of conversion, Error interrupt, Watchdog interrupt
    ADC1_IRQHandler,               // 197: End of conversion, Error interrupt, Watchdog interrupt
    Reserved198_IRQHandler,        // 198: Reserved interrupt
    CMP0_IRQHandler,               // 199: Async interrupt
    Reserved200_IRQHandler,        // 200: Reserved interrupt
    Reserved201_IRQHandler,        // 201: Reserved interrupt
    Reserved202_IRQHandler,        // 202: Reserved interrupt
    Reserved203_IRQHandler,        // 203: Reserved interrupt
    Reserved204_IRQHandler,        // 204: Reserved interrupt
    FCCU_0_IRQHandler,             // 205: Interrupt request(ALARM state)
    FCCU_1_IRQHandler,             // 206: Interrupt request(miscellaneous conditions)
    STCU_IRQHandler,               // 207: MBIST IRQ
    MU0_B_TX_IRQHandler,           // 208: ORed TX interrupt to MU-0
    MU0_B_RX_IRQHandler,           // 209: ORed RX interrupt to MU-0
    MU0_B_IRQHandler,              // 210: ORed general purpose interrupt request to MU-0
    MU1_B_TX_IRQHandler,           // 211: ORed TX interrupt to MU-1
    MU1_B_RX_IRQHandler,           // 212: ORed RX interrupt to MU-1
    MU1_B_IRQHandler,              // 213: ORed general purpose interrupt request to MU-1
    Reserved214_IRQHandler,        // 214: Reserved interrupt
    Reserved215_IRQHandler,        // 215: Reserved interrupt
    Reserved216_IRQHandler,        // 216: Reserved interrupt
    Reserved217_IRQHandler,        // 217: Reserved interrupt
    Reserved218_IRQHandler,        // 218: Reserved interrupt
    Reserved219_IRQHandler,        // 219: Reserved interrupt
    Reserved220_IRQHandler,        // 220: Reserved interrupt
    Reserved221_IRQHandler,        // 221: Reserved interrupt
    Reserved222_IRQHandler,        // 222: Reserved interrupt
    Reserved223_IRQHandler,        // 223: Reserved interrupt
    Reserved224_IRQHandler,        // 224: Reserved interrupt
    Reserved225_IRQHandler,        // 225: Reserved interrupt
    Reserved226_IRQHandler,        // 226: Reserved interrupt
    Reserved227_IRQHandler,        // 227: Reserved interrupt
    PLL_LOL_IRQHandler,            // 228: PLL LOL interrupt
    CORE_CLK_FAIL_IRQHandler,      // 229: CORE_CLK_FAIL CMU reset reaction interrupt
    Reserved230_IRQHandler,        // 230: Reserved interrupt
    AIPS_PLAT_CLK_FAIL_IRQHandler, // 231: AIPS_PLAT_CLK_FAIL CMU reset reaction interrupt
    Reserved232_IRQHandler,        // 232: Reserved interrupt
    HSE_B_CLK_FAIL_IRQHandler,     // 233: HSE_B_CLK_FAIL CMU reset reaction interrupt
};                                 /* End of __vector_table */

#if defined(__MCUXPRESSO)
//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif //(__NO_SYSTEM_INIT)

